# STOCK PRICES DATA ANALYSIS

<img src="images/stock.jpg" width="800" height="500">

In [61]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [62]:
df = pd.read_csv('Stock Prices Data set.csv', index_col=0)
df

              date      open      high       low     close    volume
symbol
AAL     2014-01-02   25.0700   25.8200   25.0600   25.3600   8998943
AAPL    2014-01-02   79.3828   79.5756   78.8601   79.0185  58791957
AAP     2014-01-02  110.3600  111.8800  109.2900  109.7400    542711
ABBV    2014-01-02   52.1200   52.3300   51.5200   51.9800   4569061
ABC     2014-01-02   70.1100   70.2300   69.4800   69.8900   1148391
...            ...       ...       ...       ...       ...       ...
XYL     2017-12-29   68.5300   68.8000   67.9200   68.2000   1046677
YUM     2017-12-29   82.6400   82.7100   81.5900   81.6100   1347613
ZBH     2017-12-29  121.7500  121.9500  120.6200  120.6700   1023624
ZION    2017-12-29   51.2800   51.5500   50.8100   50.8300   1261916
ZTS     2017-12-29   72.5500   72.7600   72.0400   72.0400   1704122

[497472 rows x 6 columns]

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 497472 entries, AAL to ZTS
Data columns (total 6 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    497472 non-null  object
 1   open    497461 non-null  float64
 2   high    497464 non-null  float64
 3   low     497464 non-null  float64
 4   close   497472 non-null  float64
 5   volume  497472 non-null  int64
dtypes: float64(4), int64(1), object(1)
memory usage: 26.6+ MB

In [64]:
df.describe()

,open,high,low,close,volume
count,497461.000000,497464.000000,497464.000000,497472.000000,4.974720e+05
mean,86.352275,87.132562,85.552467,86.369082,4.253611e+06
std,101.471228,102.312062,100.570957,101.472407,8.232139e+06
min,1.620000,1.690000,1.500000,1.590000,0.000000e+00
25%,41.690000,42.090000,41.280000,41.703750,1.080166e+06
50%,64.970000,65.560000,64.353700,64.980000,2.084896e+06
75%,98.410000,99.230000,97.580000,98.420000,4.271928e+06
max,2044.000000,2067.990000,2035.110000,2049.000000,6.182376e+08

In [65]:
df.duplicated().sum()# there are no duplicates in the dataset

0

In [66]:
df.isnull().sum()

date       0
open      11
high       8
low        8
close      0
volume     0
dtype: int64

In [67]:
df.dropna(inplace=True)
df

              date      open      high       low     close    volume
symbol
AAL     2014-01-02   25.0700   25.8200   25.0600   25.3600   8998943
AAPL    2014-01-02   79.3828   79.5756   78.8601   79.0185  58791957
AAP     2014-01-02  110.3600  111.8800  109.2900  109.7400    542711
ABBV    2014-01-02   52.1200   52.3300   51.5200   51.9800   4569061
ABC     2014-01-02   70.1100   70.2300   69.4800   69.8900   1148391
...            ...       ...       ...       ...       ...       ...
XYL     2017-12-29   68.5300   68.8000   67.9200   68.2000   1046677
YUM     2017-12-29   82.6400   82.7100   81.5900   81.6100   1347613
ZBH     2017-12-29  121.7500  121.9500  120.6200  120.6700   1023624
ZION    2017-12-29   51.2800   51.5500   50.8100   50.8300   1261916
ZTS     2017-12-29   72.5500   72.7600   72.0400   72.0400   1704122

[497461 rows x 6 columns]

In [68]:
df.isnull().sum()

date      0
open      0
high      0
low       0
close     0
volume    0
dtype: int64

In [69]:
# Remove spaces from column names
df.columns = df.columns.str.strip()
df

              date      open      high       low     close    volume
symbol
AAL     2014-01-02   25.0700   25.8200   25.0600   25.3600   8998943
AAPL    2014-01-02   79.3828   79.5756   78.8601   79.0185  58791957
AAP     2014-01-02  110.3600  111.8800  109.2900  109.7400    542711
ABBV    2014-01-02   52.1200   52.3300   51.5200   51.9800   4569061
ABC     2014-01-02   70.1100   70.2300   69.4800   69.8900   1148391
...            ...       ...       ...       ...       ...       ...
XYL     2017-12-29   68.5300   68.8000   67.9200   68.2000   1046677
YUM     2017-12-29   82.6400   82.7100   81.5900   81.6100   1347613
ZBH     2017-12-29  121.7500  121.9500  120.6200  120.6700   1023624
ZION    2017-12-29   51.2800   51.5500   50.8100   50.8300   1261916
ZTS     2017-12-29   72.5500   72.7600   72.0400   72.0400   1704122

[497461 rows x 6 columns]

In [70]:
df['date'] = pd.to_datetime(df['date'])
df

             date      open      high       low     close    volume
symbol
AAL    2014-01-02   25.0700   25.8200   25.0600   25.3600   8998943
AAPL   2014-01-02   79.3828   79.5756   78.8601   79.0185  58791957
AAP    2014-01-02  110.3600  111.8800  109.2900  109.7400    542711
ABBV   2014-01-02   52.1200   52.3300   51.5200   51.9800   4569061
ABC    2014-01-02   70.1100   70.2300   69.4800   69.8900   1148391
...           ...       ...       ...       ...       ...       ...
XYL    2017-12-29   68.5300   68.8000   67.9200   68.2000   1046677
YUM    2017-12-29   82.6400   82.7100   81.5900   81.6100   1347613
ZBH    2017-12-29  121.7500  121.9500  120.6200  120.6700   1023624
ZION   2017-12-29   51.2800   51.5500   50.8100   50.8300   1261916
ZTS    2017-12-29   72.5500   72.7600   72.0400   72.0400   1704122

[497461 rows x 6 columns]

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 497461 entries, AAL to ZTS
Data columns (total 6 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    497461 non-null  datetime64[ns]
 1   open    497461 non-null  float64
 2   high    497461 non-null  float64
 3   low     497461 non-null  float64
 4   close   497461 non-null  float64
 5   volume  497461 non-null  int64
dtypes: datetime64[ns](1), float64(4), int64(1)
memory usage: 26.6+ MB

In [74]:
columns=['open','high','low','close','volume']